The following example uses ipython-sql [1]. To install:  
pip install ipython-sql  

%sql is a Jupyter magic command and can be ignored when not using Jupyter notebooks. 

[1] https://github.com/catherinedevlin/ipython-sql

### Configure SQL for Jupyter notebook

In [7]:
#Load sql
%load_ext sql
#connect to sqlite
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

### Create a table

In [8]:
%%sql
CREATE TABLE players3 (first_name, last_name, age);
INSERT INTO players3 (first_name, last_name, age) VALUES 
    ('Lebron', 'James', 33),
    ('Steph', 'Curry', 30),
    ('Mike', 'Jordan', 55),
    ('Mike', 'Bibby', 40);

 * sqlite://
Done.
4 rows affected.

[]

### Concatenate multiple columns in SQL

In [16]:
%%sql
--Here, we will replace the first name with Goat for all Mikes over 45 years of age
--This is an example of modifying a field in a SQL table based on multiple conditions
SELECT
    first_name,
    last_name,
    age,
    --in sqlite, this syntax is first_name || last_name
    --for MySQL, Postgress, MS Access, syntax is as shown below
    concat(first_name, last_name) AS first_last_name
FROM players3

 * sqlite://
Done.

[('Lebron', 'James', 33, 'LebronJames'),
 ('Steph', 'Curry', 30, 'StephCurry'),
 ('Mike', 'Jordan', 55, 'MikeJordan'),
 ('Mike', 'Bibby', 40, 'MikeBibby')]